from aiogram import types, Router
from keyboards.reply import explanations, menu

router = Router()

# ========================= الشروحات =========================
@router.message(lambda m: m.text == "📚 الشروحات")
async def tutorials(m: types.Message):

    await m.answer(
        '📚 الشروحات',
        reply_markup=explanations
    )

@router.message(lambda m: m.text == "ما هو موقع Ichancy؟")
async def tutorials(m: types.Message):

    await m.answer(
        """
ما هو موقع Ichancy؟

موقع Ichancy هو منصة ترفيهية متكاملة تُقدم خدمات المراهنات الرياضية، ألعاب السلوت، ألعاب الكازينو، وألعاب متنوعة (Games)، مع نظام آلي لحساب الأرباح بناءً على النسب المرتبطة بكل خيار.

أقسام الموقع:

1. الرياضة (Sports):
يتيح للمستخدمين المراهنة على مجموعة واسعة من الأحداث الرياضية، مثل كرة القدم، كرة السلة، التنس وغيرها، مع خيارات متعددة ونسب متغيرة.

آلية العمل :

يختار المراهن خيارًا رياضيًا واحدًا أو أكثر قبل بدء الحدث.

تُضرب النسبة المحددة (Odds) في مبلغ الرهان لتحديد العائد المحتمل.

إذا تحقق الخيار، يحصل المستخدم على المبلغ الناتج من العملية.

تعتمد المراهنة على احتمالية الربح أو الخسارة.

2. السلوت (Slot):
ألعاب الحظ الممتعة برسومات جذابة وآليات دوران بسيطة، حيث يمكن للمستخدم تجربة حظه والفوز بمكافآت فورية.

3. الكازينو (Casino):
مجموعة متنوعة من ألعاب الكازينو التقليدية مثل الروليت، البلاك جاك، البوكر، وغيرها، ضمن تجربة محاكاة احترافية.

4. الألعاب (Games):
يضم هذا القسم ألعابًا إلكترونية وتفاعلية مسلية، تتنوع بين ألعاب الحظ، ألعاب المهارة، والتحديات السريعة، حيث يمكن للمستخدم اللعب والفوز بجوائز مباشرة.

لزيارة الموقع الرسمي:
https://ichancy.com
"""
    )

@router.message(lambda m: m.text == "كيفية شحن الرصيد ضمن بوت Ichancy")
async def tutorials(m: types.Message):

    await m.answer("""
كيفية شحن الرصيد ضمن بوت Ichancy

يرجى اتباع الخطوات التالية لإتمام عملية شحن الرصيد بنجاح:

1. اضغط على خيار "شحن رصيد" في واجهة البوت.

2. اختر طريقة الدفع المناسبة لك من بين الخيارات المتاحة.

3. قم بإرسال المبلغ الذي ترغب في شحنه إلى العنوان المخصّص (أقل مبلغ يمكن شحنه هو 1 دولار أمريكي).

4. بعد إتمام التحويل، أدخل كود عملية التحويل، ثم أدخل قيمة المبلغ المرسل.

✅ تم شحن البوت بنجاح.
"""
        ,
    )

@router.message(lambda m: m.text == "كيفية إنشاء حساب Ichancy جديد")
async def tutorials(m: types.Message):

    await m.answer("""
كيفية إنشاء حساب Ichancy جديد

لإنشاء حساب جديد على موقع Ichancy عبر البوت، يرجى اتباع الخطوات التالية:

1. اضغط على خيار "Ichancy" في واجهة البوت.

2. اختر "حساب Ichancy جديد".

3. أدخل اسمًا للحساب الجديد.

4. أدخل كلمة مرور لا تقل عن 8 أرقام.

5. أدخل المبلغ الذي ترغب بشحن الحساب به بالدولار ($).

6. انتظر حوالي 15 ثانية لمعالجة الطلب.

✅ تم إنشاء الحساب بنجاح.
""",
    )

@router.message(lambda m: m.text == "كيفيّة سحب الرصيد من بوت Ichancy")
async def tutorials(m: types.Message):

    await m.answer("""
كيفيّة سحب الرصيد من بوت Ichancy

لإتمام عملية السحب بنجاح، يرجى اتباع الخطوات التالية:

1. اضغط على خيار "سحب رصيد" من واجهة البوت.

2. اختر طريقة السحب المناسبة لك من بين الوسائل المتاحة.

3. أدخل بياناتك المطلوبة بدقة، بحسب الطريقة التي قمت باختيارها.

4. أدخل المبلغ الذي ترغب بسحبه.

✅ تم تنفيذ عملية السحب بنجاح.
يتم معالجة طلب السحب خلال مدة أقصاها نصف ساعة.
""",
    )

@router.message(lambda m: m.text == "كيفية شحن رصيد ضمن حساب Ichancy")
async def tutorials(m: types.Message):

    await m.answer("""
كيفية شحن رصيد ضمن حساب Ichancy
لشحن رصيد إلى حسابك في موقع Ichancy عبر البوت، يرجى اتباع الخطوات التالية:

1. اضغط على خيار "Ichancy" في واجهة البوت.

2. اختر "شحن حساب Ichancy".

3. أدخل معرّف الحساب أو اسم حساب Ichancy الذي ترغب بشحنه.

4. أدخل المبلغ المطلوب شحنه بالليرة السوريّة .

5. انتظر حوالي 15 ثانية حتى تتم معالجة العملية.

✅ تم شحن الحساب بنجاح.
"""
    )

@router.message(lambda m: m.text == "كيفية سحب رصيد من حساب Ichancy")
async def tutorials(m: types.Message):

    await m.answer("""
كيفية سحب رصيد من حساب Ichancy

لسحب رصيد من حسابك في موقع Ichancy عبر البوت، يرجى اتباع الخطوات التالية:

1. اضغط على خيار "Ichancy" في واجهة البوت.

2. اختر "سحب رصيد من حساب Ichancy".

3. أدخل معرّف الحساب أو اسم حساب Ichancy الذي ترغب بالسحب منه.

4. أدخل المبلغ المطلوب سحبه بالدولار ($).

5. انتظر حوالي 15 ثانية حتى تتم معالجة العملية.

✅ تم سحب الرصيد بنجاح.

"""
    )

@router.message(lambda m: m.text == "القائمة الرئيسية")
async def tutorials(m: types.Message):

    await m.answer(
        "القائمة الرئيسية",
        reply_markup=menu
    )


